src/__tests__/mock-response/reservation-rs-one-call.xml

<?xml version="1.0" encoding="utf-8"?>
<ArrayOfTReservationRS xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <TReservationRS>
    <success />
    <reservation>
      <hotelId>123</hotelId>
      <portalId>1</portalId>
      <id>2222</id>
      <status>new</status>
      <createDateTime>2015-12-01T23:39:00Z</createDateTime>
      <paymentType>1</paymentType>
      <remark>Comentários</remark>
      <currencyCode>BRL</currencyCode>
      <locatorId>5689</locatorId>
      <totalValue>350,50</totalValue>
      <rooms>
        <room>
          <id>1</id>
          <roomLocatorId>235469</roomLocatorId>
          <roomTypeId>222</roomTypeId>
          <status>active</status>
          <arrivalDate>22/10/2016</arrivalDate>
          <departureDate>24/10/2016</departureDate>
          <adults>2</adults>
          <children>1</children>
          <ageChildren>
            <ageChild>3</ageChild>
          </ageChildren>
          <totalValue>300,50</totalValue>
          <remark>Comentários</remark>
          <addons>
            <addon>
              <name>Decoração especial no quarto</name>
              <totalValue>50,00</totalValue>
            </addon>
          </addons>
          <dailyRates>
            <dailyRate>
              <date>22/10/2016</date>
              <totalValue>130,00</totalValue>
            </dailyRate>
            <dailyRate>
              <date>23/10/2016</date>
              <totalValue>120,00</totalValue>
            </dailyRate>
          </dailyRates>
          <mealPlan>1</mealPlan>
          <guest>
            <firstName>Volnei Hartaman</firstName>
            <lastName>Silva</lastName>
            <email>volnei@gmail.com</email>
          </guest>
        </room>
      </rooms>
      <guest>
        <firstName>Antonio Rodrigues</firstName>
        <lastName>Antonio Rodrigues</lastName>
        <documentType>CPF</documentType>
        <documentNumber>22687496532</documentNumber>
        <email>ar@host.com</email>
        <phone>1141267898</phone>
      </guest>
      <payment>
        <cardType>VISA</cardType>
        <prePaymentValue>95,50</prePaymentValue>
        <prePaymentCharged>true</prePaymentCharged>
        <authorizationCode>34cx5632xxgr2111</authorizationCode>
      </payment>
      <collectType>CanalCollect</collectType>
    </reservation>
  </TReservationRS>
  <TReservationRS>
    <success />
    <reservation>
      <hotelId>555</hotelId>
      <portalId>20</portalId>
      <id>965985555</id>
      <status>new</status>
      <createDateTime>2011-12-30T23:39:00Z</createDateTime>
      <paymentType>1</paymentType>
      <remark>Comentários</remark>
      <currencyCode>BRL</currencyCode>
      <locatorId>5690</locatorId>
      <totalValue>350.00</totalValue>
      <rooms>
        <room>
          <id>1</id>
          <roomLocatorId>236478</roomLocatorId>
          <roomTypeId>333</roomTypeId>
          <status>active</status>
          <arrivalDate>27/08/2016</arrivalDate>
          <departureDate>30/08/2016</departureDate>
          <adults>2</adults>
          <children>1</children>
          <totalValue>850,00</totalValue>
          <remark>Comentários</remark>
          <dailyRates>
            <dailyRate>
              <date>27/08/2016</date>
              <totalValue>250,00</totalValue>
            </dailyRate>
            <dailyRate>
              <date>28/08/2016</date>
              <totalValue>250,00</totalValue>
            </dailyRate>
            <dailyRate>
              <date>29/08/2016</date>
              <totalValue>350,00</totalValue>
            </dailyRate>
          </dailyRates>
          <mealPlan>1</mealPlan>
          <guest>
            <firstName>Volnei Hartaman</firstName>
            <lastName>Silva</lastName>
            <email>volnei@gmail.com</email>
          </guest>
        </room>
      </rooms>
      <guest>
        <firstName>Antonio Rodrigues</firstName>
        <lastName>Antonio Rodrigues</lastName>
        <documentType>Passport</documentType>
        <documentNumber>22687496532</documentNumber>
        <email>ar@host.com</email>
        <phone>1141267898</phone>
      </guest>
      <payment>
        <cardType>MASTERCARD</cardType>
        <prePaymentValue>350.00</prePaymentValue>
        <numberOfInstallments>2</numberOfInstallments>
        <installmentValue>150,00</installmentValue>
        <prePaymentCharged>true</prePaymentCharged>
        <authorizationCode>34cx5632xxgr2111</authorizationCode>
      </payment>
      <collectType>CanalCollect</collectType>
    </reservation>
  </TReservationRS>
</ArrayOfTReservationRS>
